# 04 dataframe 을 만드는 다양한 방법

### From list of lists, array of arrays, list of series

dataFrame 만들수 있는 재료 3가지

* 2차원 리스트
* numpy array
* pandas Series를 담고있는 리스트

dataframe 을 만들떄 따로 column과 row(index)에 대한 설정이 없으면 그냥 0,1,2...순서로 매겨짐

In [9]:
import numpy as np
import pandas as pd

two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]
two_dimensional_array = np.array(two_dimensional_list)
list_of_series = [
    pd.Series(['dongwook', 50, 86]), 
    pd.Series(['sineui', 89, 31]), 
    pd.Series(['ikjoong', 68, 91]), 
    pd.Series(['yoonsoo', 88, 75])
]

셋다 같은 내용이 들어있다

In [23]:
two_dimensional_list

[['dongwook', 50, 86],
 ['sineui', 89, 31],
 ['ikjoong', 68, 91],
 ['yoonsoo', 88, 75]]

In [22]:
my_df = pd.DataFrame(two_dimensional_list)
my_df

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [14]:
two_dimensional_array

array([['dongwook', '50', '86'],
       ['sineui', '89', '31'],
       ['ikjoong', '68', '91'],
       ['yoonsoo', '88', '75']], dtype='<U8')

In [16]:
my_df = pd.DataFrame(two_dimensional_array)
my_df

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [17]:
list_of_series

[0    dongwook
 1          50
 2          86
 dtype: object,
 0    sineui
 1        89
 2        31
 dtype: object,
 0    ikjoong
 1         68
 2         91
 dtype: object,
 0    yoonsoo
 1         88
 2         75
 dtype: object]

In [21]:
my_dr = pd.DataFrame(list_of_series)
my_dr

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

### From dict of lists, dict of arrays, dict of seroes

python dictionary로도 dataframe 을 만들 수 있다

만드는 순서

1. 사전의 key로는 column 이름을 쓰고   
2. 그 colums에 해당하는 자료형들을 사전의 value로 넣어 주면 됨
* 리스트 
* numpy array
* pandas series

In [13]:
import numpy as np
import pandas as pd

names = ['dongwook', 'sineui', 'ikjoong', 'yoonsoo']
english_scores = [50, 89, 68, 88]
math_scores = [86, 31, 91, 75]

dict1 = {
    'name': names, 
    'english_score': english_scores, 
    'math_score': math_scores
}

dict1

{'name': ['dongwook', 'sineui', 'ikjoong', 'yoonsoo'],
 'english_score': [50, 89, 68, 88],
 'math_score': [86, 31, 91, 75]}

In [24]:
my_df = pd.DataFrame(dict1)
my_df

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

### from list of dicts

!!리스트가 담긴 사전 말고도 사전이 담긴 리스트로도 daraFrame 을 만들수 있다!!!!!

In [25]:
my_list = [
    {'name': 'dongwook', 'english_score': 50, 'math_score': 86},
    {'name': 'sineui', 'english_score': 89, 'math_score': 31},
    {'name': 'ikjoong', 'english_score': 68, 'math_score': 91},
    {'name': 'yoonsoo', 'english_score': 88, 'math_score': 75}
]

df = pd.DataFrame(my_list)
print(df)

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [26]:
df

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75